{
  "kind": "build_request",
  "title": "Add a Top 5 Most-Viewed Shorts section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add a new content list for the channel’s “Top 5 Most-Viewed Shorts” (five items) in the frontend content data file so the site owner can easily update titles and links without editing UI components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Can you add my  top viewed 5 shorts"
        ]
      },
      "acceptanceCriteria": [
        "A new exported data structure exists in frontend/src/content/channelContent.ts that represents exactly 5 Shorts items.",
        "Each Shorts item includes at minimum: id, title, url, and a views label/value that can be displayed (e.g., \"1.2M views\" or a number).",
        "The file contains initial placeholder entries that compile and are clearly identifiable for later replacement with the user’s real Shorts links."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a new on-page section titled “Top 5 Most-Viewed Shorts” that renders the five Shorts as prominent, clickable cards/links consistent with the site’s existing visual style.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Can you add my  top viewed 5 shorts"
        ]
      },
      "acceptanceCriteria": [
        "The page includes a new section with a stable anchor id (e.g., id=\"shorts\").",
        "The section displays exactly 5 Shorts items from the new content list, ordered 1–5.",
        "Each card/link opens the Shorts URL in a new tab (same external-link behavior as existing featured content links).",
        "The card UI shows the Shorts title and the views label/value in readable English text."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the site header navigation to include a “Shorts” in-page link that scrolls smoothly to the new “Top 5 Most-Viewed Shorts” section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Can you add my  top viewed 5 shorts"
        ]
      },
      "acceptanceCriteria": [
        "Desktop navigation includes a “Shorts” item that scrolls to the Shorts section.",
        "Mobile navigation includes the same “Shorts” item and closes the menu after navigation (consistent with existing behavior).",
        "Existing navigation items (About, Featured, Connect) continue to work unchanged."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add YouTube API integration or any external data fetching for Shorts; use the existing pattern of frontend-managed content in frontend/src/content/channelContent.ts.",
    "Do not add backend functionality for this change (backend/main.mo should remain unused unless explicitly required later)."
  ],
  "nonGoals": [
    "Automatically detecting the user’s top Shorts from YouTube (no YouTube Data API usage).",
    "Adding video thumbnails, embeds, or autoplay players for Shorts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}