{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Top 5 Most-Viewed Shorts section",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add a frontend-managed Top 5 Most-Viewed Shorts content list in the channel content data file.",
      "acceptanceCriteria": [
        "A new exported data structure exists in frontend/src/content/channelContent.ts that represents exactly 5 Shorts items.",
        "Each Shorts item includes at minimum: id, title, url, and a views label/value that can be displayed (e.g., \"1.2M views\" or a number).",
        "The file contains initial placeholder entries that compile and are clearly identifiable for later replacement with the user’s real Shorts links."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/channelContent.ts",
          "operation": "modify",
          "description": "Add a new exported Shorts item type (including id, title, url, and a displayable views label/value) and a new exported list for “Top 5 Most-Viewed Shorts” containing exactly five clearly-labeled placeholder entries, following the existing pattern used for featuredContent/socialLinks."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Render a new “Top 5 Most-Viewed Shorts” on-page section showing five prominent clickable cards consistent with existing styling.",
      "acceptanceCriteria": [
        "The page includes a new section with a stable anchor id (e.g., id=\"shorts\").",
        "The section displays exactly 5 Shorts items from the new content list, ordered 1–5.",
        "Each card/link opens the Shorts URL in a new tab (same external-link behavior as existing featured content links).",
        "The card UI shows the Shorts title and the views label/value in readable English text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopShortsGrid.tsx",
          "operation": "create",
          "description": "Create a reusable grid component to render the 5 Shorts items as prominent clickable cards/links, reusing existing visual patterns (e.g., shadcn-ui Card) and using the existing ExternalLink wrapper for safe new-tab external navigation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new on-page section titled “Top 5 Most-Viewed Shorts” with a stable anchor id (id=\"shorts\") that renders exactly five items from the new channelContent Shorts list via TopShortsGrid, displayed in order 1–5 and placed consistently among existing sections."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add a “Shorts” anchor link to the site header navigation for desktop and mobile, preserving existing behavior.",
      "acceptanceCriteria": [
        "Desktop navigation includes a “Shorts” item that scrolls to the Shorts section.",
        "Mobile navigation includes the same “Shorts” item and closes the menu after navigation (consistent with existing behavior).",
        "Existing navigation items (About, Featured, Connect) continue to work unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the header nav items to include a “Shorts” entry linking to #shorts, ensuring it uses the existing smooth-scroll click handler so desktop and mobile navigation behavior remains consistent and the mobile menu closes after navigation."
        }
      ]
    }
  ]
}